#+TITLE: Plan for Analytics Dashboard
#+AUTHOR: VLEAD
#+DATE: [2017-09-12 Tue]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  - This document briefly explains plan for =analytics-dashboard= project.

* Feedback Visualization 
  - Initially created a container on base4 to request on port 80. Posted 
    edited format of data in the elastic search and made visualization in kibana.
  - Found errors in the  format of data posted into kibana so there was a need
    to change the format of data to post into kibana due to few issues
    mentioned below.
       - We cannot traverse through different index and access data
       - we cannot get the overall feedback of all the feedback online and
         offline.
  - Worked on the kibana feeding the elastic search with the index
    feedback-index with the changed format of question and answers but there
    was a conflict for displaying the total no of feed back for each question
    and also for online and offline feedback.
  - So moved from kibana to Chart.js but as per the instructions
    of maruthi sir, he suggested to create two indexes for online and offline
    and make those two indexes to join as another single index. That was
    complex in doing.
  - Changed the format of the json to be feed to elastic search. Adding a new
    attribute like mode to the existence json so that we can get the overall
    feedback without any issue.
  - Based on the discussion with Thirumal, as there was no modularity in using
    kibana and need to change many thing in the structure of json data, we stopped
    using of kibana and started on work on javascript.
  - Worked  on the script for the data to traverse and display
    the data in console.
  - As there are five versions in feedback portal trying to put the data in
    another json in a structure format which is readable and be  mapped to
    the questions to each versions so it would be easy to read the data and give
    overall feedback based on versions and also irrespective of versions also.
  - Able to read the data and print version, question and answer in  console. 
    Collected data obtained from elastic search and visualise data by using
    chart.js
  - Generated a generic feedback graph  based on versions.
  - Created feedback visualisations for generic lab, generic experiment
  - Faced few problems in visualising openedx lab and experiment resolved them.
  - Created feedback visualisations for openedx lab and open edx experiment.
  - Created horizontal tabs and based on the click on the horizontal tabs the
    graphs should be displayed on the screen.
    Worked on visualising data and designed UI
  - Linked the graphs with  horizontal tabs. Also data in the graphs are also
    dynamically loaded from the base4.
  - Added Legends to the graphs based on the versions.   
  - Now next step is to add accordion to the horizontal tabs so that when we click
    on the version it drop downs the list of questions in that particular
    division.
  - Later linking the questions with the graphs and load dynamically by taking data
    from base4.



* Plan ([[https://github.com/vlead/analytics-dashboard/milestone/2][Milestone 2]])
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone2
  :END: 
  Dynamically display all feedbacks from the data stored in elastic search.

|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
|    S. | Tasks                | Github | Expected | Actual |  Estimated |     Actual | Status   | Assignee  |
|    NO |                      | Issues | Effort   | Effort |     Start, |     Start, |          |           |
|       |                      |        | (in      | (in    |        End |        End |          |           |
|       |                      |        | person   | person |      Dates |      Dates |          |           |
|       |                      |        | hours)   | hours) |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
|    1. | Display total        | [[https://github.com/vlead/analytics-dashboard/issues/22][#22]]    | 12       | 12     | 27-08-2017 | 27-08-2017 | Done     | Mrudhvika |
|       | number of feedbacks  |        |          |        | 28-08-2017 | 28-08-2017 |          |           |
|       | on the top           |        |          |        |            |            |          |           |
|       |                      |        |          |        |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
|    2. | Dynamically display  | [[https://github.com/vlead/analytics-dashboard/issues/23][#23]]    | 32       | 36     | 21-07-2017 | 21-07-2017 | Done     | Mrudhvika |
|       | feedbacks yearly     |        |          |        | 24-07-2017 | 25-07-2017 |          | Reena     |
|       | wise                 |        |          |        |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
|    3. | Display feedbacks of | [[https://github.com/vlead/analytics-dashboard/issues/24][#24]]    |          |        |            |            | Done     | Reena     |
|       | a particular year    |        |          |        |            |            |          |           |
|       | on the basis of lab, |        |          |        |            |            |          |           |
|       | exp and generic      |        |          |        |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
|    4. | Present feedbacks in | [[https://github.com/vlead/analytics-dashboard/issues/25][#25]]    |          |        |            |            | In       | Reena     |
|       | further detail       |        |          |        |            |            | Progress |           |
|       | depends on OL, NOL,  |        |          |        |            |            |          |           |
|       | OE, NOE and generic  |        |          |        |            |            |          |           |
|       |                      |        |          |        |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
|    5. | Transisions of all   | [[https://github.com/vlead/analytics-dashboard/issues/26][#26]]    |          |        |            |            | In       | Reena     |
|       | the graphs and       |        |          |        |            |            | Progress |           |
|       | arrange them         |        |          |        |            |            |          |           |
|       | properly in a page   |        |          |        |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
| Total |                      |        | 44       |        |            |            |          |           |
|     ^ |                      |        | total    |        |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
#+TBLFM: $total=vsum(@II+1..@-1)

* Realization 
    :PROPERTIES:
    :CUSTOM_ID: 
    :END:    
  Implementing the above plan will result into the following -
- Able to display total number of feedbacks.
- Display feedbacks year, percentage and version wise.
